CheckoutLeo/Checkout/build/resources/main/WSFretesPayPal.wsdl

<?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2-hudson-740-. --><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2-hudson-740-. --><definitions xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:tns="https://ff.paypal-brasil.com.br/FretesPayPalWS" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" targetNamespace="https://ff.paypal-brasil.com.br/FretesPayPalWS" name="WSFretesPayPalService">
  <types>
 <xs:schema xmlns:tns="https://ff.paypal-brasil.com.br/FretesPayPalWS" xmlns:xs="http://www.w3.org/2001/XMLSchema" version="1.0" targetNamespace="https://ff.paypal-brasil.com.br/FretesPayPalWS">

  <xs:element name="getPreco" type="tns:getPreco" />

  <xs:element name="getPrecoResponse" type="tns:getPrecoResponse" />

  <xs:complexType name="getPreco">
    <xs:sequence>
      <xs:element name="cepOrigem" type="xs:string" minOccurs="0" />
      <xs:element name="cepDestino" type="xs:string" minOccurs="0" />
      <xs:element name="largura" type="xs:int" />
      <xs:element name="altura" type="xs:int" />
      <xs:element name="profundidade" type="xs:int" />
      <xs:element name="peso" type="xs:string" minOccurs="0" />
    </xs:sequence>
  </xs:complexType>

  <xs:complexType name="getPrecoResponse">
    <xs:sequence>
      <xs:element name="return" type="xs:double" />
    </xs:sequence>
  </xs:complexType>
</xs:schema>

  </types>
  <message name="getPreco">
    <part name="parameters" element="tns:getPreco" />
  </message>
  <message name="getPrecoResponse">
    <part name="parameters" element="tns:getPrecoResponse" />
  </message>
  <portType name="WSFretesPayPal">
    <operation name="getPreco">
      <input wsam:Action="https://ff.paypal-brasil.com.br/FretesPayPalWS/WSFretesPayPal/getPrecoRequest" message="tns:getPreco" />
      <output wsam:Action="https://ff.paypal-brasil.com.br/FretesPayPalWS/WSFretesPayPal/getPrecoResponse" message="tns:getPrecoResponse" />
    </operation>
  </portType>
  <binding name="WSFretesPayPalPortBinding" type="tns:WSFretesPayPal">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document" />
    <operation name="getPreco">
      <soap:operation soapAction="" />
      <input>
        <soap:body use="literal" />
      </input>
      <output>
        <soap:body use="literal" />
      </output>
    </operation>
  </binding>
  <service name="WSFretesPayPalService">
    <port name="WSFretesPayPalPort" binding="tns:WSFretesPayPalPortBinding">
      <soap:address location="http://ff.paypal-brasil.com.br:443/FretesPayPalWS/WSFretesPayPal" />
    </port>
  </service>
</definitions>